app/Models/ProjectModel/AboutModel.php

SELECT *
FROM `about`
WHERE `section` = 'mission'
---
    public function getAboutSection($section)
    {
        return $this->where('section', $section)->findAll();