app/Models/ProjectModel/BookModel.php

SELECT *
FROM `books`
WHERE `bestseller` = 0
---
    public function getAllBooks()
    {
        return $this->where('bestseller', 0)->findAll();

SELECT *
FROM `books`
WHERE `category_id` = '2'
---
    public function getBooksByCategory($categoryId)
    {
        return $this->where('category_id', $categoryId)->findAll();

SELECT *
FROM `books`
WHERE `title` LIKE '%kfjf;fjkss%' ESCAPE '!'
OR  `author` LIKE '%kfjf;fjkss%' ESCAPE '!'
OR  `description` LIKE '%kfjf;fjkss%' ESCAPE '!'
---
    public function searchBooks($query)
    {
        return $this->like('title', $query)
                    ->orLike('author', $query)
                    ->orLike('description', $query)
                    ->findAll();