app/Models/ProjectModel/CartModel.php

    public function getCartItemsWithDetails()
    {
        $cartItems = $this->findAll(); // Fetch all items from the cart table

        // Fetch book details for each cart item
        foreach ($cartItems as &$item) {
            $book = $this->bookModel->find($item['book_id']);
---
SELECT *
FROM `cart`
SELECT *
FROM `books`
WHERE `books`.`id` = '1'

    public function addToCart($bookId)
    {
        // Example method to add a book to cart, adjust according to your requirements
        // Example implementation, adjust as per your actual database structure and logic
        $this->insert(['book_id' => $bookId, 'quantity' => 1]);
---
INSERT INTO `cart` (`book_id`, `quantity`) VALUES ('1', 1)

    public function removeFromCart($cartId)
    {
        // Example method to remove an item from cart, adjust according to your requirements
        // Example implementation, adjust as per your actual database structure and logic
        $this->delete($cartId);
---
DELETE FROM `cart`
WHERE `id` IN ('6')