app/Models/ProjectModel/ReviewModel.php

    public function getReviewsByBook($book_id)
    {
        return $this->where('book_id', $book_id)->findAll();
---
SELECT *
FROM `reviews`
WHERE `book_id` = '1'

    public function getLatestReviewsByBook($book_id, $limit = 3)
    {
        return $this->where('book_id', $book_id)->orderBy('created_at', 'DESC')->limit($limit)->findAll();
---
SELECT *
FROM `reviews`
WHERE `book_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 3

    public function getLatestHighRatingReviews($limit = 4)
    {
        return $this->where('rating >=', 4)->orderBy('created_at', 'DESC')->limit($limit)->findAll();
---
SELECT *
FROM `reviews`
WHERE `rating` >= 4
ORDER BY `created_at` DESC
 LIMIT 4