app/Models/ProjectModel/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'abhinav1828'
 LIMIT 1
---
    public function getUserByUsername($username)
    {
        $user = $this->where('username', $username)->first();