app/Controllers/ProjectControllers/BookController.php

SELECT *
FROM `categories`
---
    public function index()
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return redirect()->to(site_url('project/login'))->with('error', 'Please login to access the dashboard.');
        }

        $bookModel = new BookModel();
        $bestsellerModel = new BestsellerModel();
        $categoryModel = new CategoryModel(); // Create an instance of CategoryModel

        $books = $bookModel->getAllBooks();
        $bestsellers = $bestsellerModel->getBestsellers();
        $categories = $categoryModel->findAll(); // Fetch all categories

SELECT *
FROM `books`
WHERE `books`.`id` = '1'
SELECT *
FROM `categories`
WHERE `categories`.`id` = '1'
---
    public function view($id)
    {
        $bookModel = new BookModel();
        $reviewModel = new ReviewModel();
        $categoryModel = new CategoryModel(); // Create an instance of CategoryModel

        $book = $bookModel->find($id);
        if (!$book) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Book not found');
        }

        $reviews = $reviewModel->getReviewsByBook($id);
        $category = $categoryModel->find($book['id']); // Get category based on book's category ID

SELECT *
FROM `categories`
---
    public function categories()
    {
        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();

SELECT *
FROM `categories`
WHERE `categories`.`id` = '1'
---
    public function category($categoryId)
    {
        $bookModel = new BookModel();
        $categoryModel = new CategoryModel();

        $books = $bookModel->getBooksByCategory($categoryId);
        $category = $categoryModel->find($categoryId);