app/Controllers/ProjectControllers/BookController.php

    public function view($id)
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return redirect()->to(site_url('project/login'))->with('error', 'Please login to access the dashboard.');
        }

        $bookModel = new BookModel();
        $reviewModel = new ReviewModel();
        $categoryModel = new CategoryModel(); // Create an instance of CategoryModel

        $book = $bookModel->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '1'

    public function categories()
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return redirect()->to(site_url('project/login'))->with('error', 'Please login to access the dashboard.');
        }

        $categoryModel = new CategoryModel(); // Create an instance of CategoryModel
        $categories = $categoryModel->findAll(); // Fetch all categories
---
SELECT *
FROM `categories`