app/Controllers/ProjectControllers/DashboardController.php

SELECT *
FROM `categories`
---
    public function index()
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return redirect()->to(site_url('project/login'))->with('error', 'Please login to access the dashboard.');
        }

        // Get all bestsellers
        $bestsellers = $this->bestsellerModel->getBestsellers();

        // Initialize array for filtered bestsellers
        $filteredBestsellers = [];

        // Filter bestsellers based on average rating >= 4
        foreach ($bestsellers as $book) {
            $avgRating = $this->reviewModel->getAverageRating($book['id']);
            if ($avgRating >= 4) {
                $book['avg_rating'] = $avgRating;
                $book['latest_reviews'] = $this->reviewModel->getLatestReviewsByBook($book['id']);
                $filteredBestsellers[] = $book;
            }
        }

        // Limit to 4 bestsellers
        $limitedBestsellers = array_slice($filteredBestsellers, 0, 4);

        $data = [
            'bestsellers' => $limitedBestsellers,
            'categories' => $this->categoryModel->findAll(),