app/Controllers/ProjectControllers/ReviewController.php

    public function add()
    {
        $reviewModel = new ReviewModel();

        $data = [
            'book_id' => $this->request->getPost('book_id'),
            'user_id' => session()->get('user')['id'], // Assuming user session contains user info
            'rating' => $this->request->getPost('rating'),
            'comment' => $this->request->getPost('comment'),
        ];

        if ($reviewModel->insert($data)) {
---
INSERT INTO `reviews` (`book_id`, `user_id`, `rating`, `comment`) VALUES ('7', '1', '4', 'gjldnbgk')